In [1]:
import numpy as np
import pandas as pd

In [2]:
ss=pd.DataFrame()

In [3]:
df=pd.read_csv("students.csv")

In [4]:
df

      Rank       Name  Age  Gender Background  Python  Machine Learning
0   Rank 1       Ravi   23    Male       Tech      89                95
1   Rank 2    Chandni   22  Female   Non-Tech      78                83
2   Rank 3    Gyanesh   25    Male       Tech      70                80
3   Rank 4      Rahul   22    Male       Tech      68                75
4   Rank 5     Kartik   23    Male       Tech      60                70
5   Rank 6  Pratiksha   24  Female   Non-Tech      58                55
6   Rank 7       Maya   22  Female   Non-Tech      55                50
7   Rank 8      Shani   21    Male       Tech      50                50
8   Rank 9     Neelam   24  Female   Non-Tech      50                47
9  Rank 10     Mangal   22    Male   Non-Tech      45                46

In [5]:
df.head()

     Rank     Name  Age  Gender Background  Python  Machine Learning
0  Rank 1     Ravi   23    Male       Tech      89                95
1  Rank 2  Chandni   22  Female   Non-Tech      78                83
2  Rank 3  Gyanesh   25    Male       Tech      70                80
3  Rank 4    Rahul   22    Male       Tech      68                75
4  Rank 5   Kartik   23    Male       Tech      60                70

In [6]:
df.tail()

      Rank       Name  Age  Gender Background  Python  Machine Learning
5   Rank 6  Pratiksha   24  Female   Non-Tech      58                55
6   Rank 7       Maya   22  Female   Non-Tech      55                50
7   Rank 8      Shani   21    Male       Tech      50                50
8   Rank 9     Neelam   24  Female   Non-Tech      50                47
9  Rank 10     Mangal   22    Male   Non-Tech      45                46

In [7]:
df.dtypes

Rank                object
Name                object
Age                  int64
Gender              object
Background          object
Python               int64
Machine Learning     int64
dtype: object

In [8]:
df.shape

(10, 7)

In [9]:
df.columns

Index(['Rank', 'Name', 'Age', 'Gender', 'Background', 'Python',
       'Machine Learning'],
      dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Rank              10 non-null     object
 1   Name              10 non-null     object
 2   Age               10 non-null     int64
 3   Gender            10 non-null     object
 4   Background        10 non-null     object
 5   Python            10 non-null     int64
 6   Machine Learning  10 non-null     int64
dtypes: int64(3), object(4)
memory usage: 688.0+ bytes

In [11]:
df.Name#dot notation

0         Ravi
1      Chandni
2      Gyanesh
3        Rahul
4       Kartik
5    Pratiksha
6         Maya
7        Shani
8       Neelam
9       Mangal
Name: Name, dtype: object

In [12]:
df["Machine Learning"]# bracket  notation

0    95
1    83
2    80
3    75
4    70
5    55
6    50
7    50
8    47
9    46
Name: Machine Learning, dtype: int64

# loc

In [13]:
df.loc[5]

Rank                   Rank 6
Name                Pratiksha
Age                        24
Gender                 Female
Background           Non-Tech
Python                     58
Machine Learning           55
Name: 5, dtype: object

In [14]:
# df.loc[3:7]

In [15]:
df.loc[3:7,["Name","Age"]]

        Name  Age
3      Rahul   22
4     Kartik   23
5  Pratiksha   24
6       Maya   22
7      Shani   21

# iloc

In [16]:
df.iloc[3]

Rank                Rank 4
Name                 Rahul
Age                     22
Gender                Male
Background            Tech
Python                  68
Machine Learning        75
Name: 3, dtype: object

In [17]:
df.iloc[3:7]

     Rank       Name  Age  Gender Background  Python  Machine Learning
3  Rank 4      Rahul   22    Male       Tech      68                75
4  Rank 5     Kartik   23    Male       Tech      60                70
5  Rank 6  Pratiksha   24  Female   Non-Tech      58                55
6  Rank 7       Maya   22  Female   Non-Tech      55                50

In [18]:
df.iloc[3,[1,2,3,4]]

Name          Rahul
Age              22
Gender         Male
Background     Tech
Name: 3, dtype: object

In [19]:
df.iloc[3:7,[1,2,3]]

        Name  Age  Gender
3      Rahul   22    Male
4     Kartik   23    Male
5  Pratiksha   24  Female
6       Maya   22  Female

In [20]:
df.describe()

             Age     Python  Machine Learning
count  10.000000  10.000000         10.000000
mean   22.800000  62.300000         65.100000
std     1.229273  13.864824         17.666352
min    21.000000  45.000000         46.000000
25%    22.000000  51.250000         50.000000
50%    22.500000  59.000000         62.500000
75%    23.750000  69.500000         78.750000
max    25.000000  89.000000         95.000000

In [21]:
df.Gender.value_counts()

Male      6
Female    4
Name: Gender, dtype: int64

In [22]:
df['total']=df.Python+df['Machine Learning']

In [23]:
df.head()

     Rank     Name  Age  Gender Background  Python  Machine Learning  total
0  Rank 1     Ravi   23    Male       Tech      89                95    184
1  Rank 2  Chandni   22  Female   Non-Tech      78                83    161
2  Rank 3  Gyanesh   25    Male       Tech      70                80    150
3  Rank 4    Rahul   22    Male       Tech      68                75    143
4  Rank 5   Kartik   23    Male       Tech      60                70    130

In [24]:
city=['chennai','delhi','mumbai','chennai','delhi','mumbai','chennai','delhi','mumbai',"kerala"]

In [25]:
df['city']=city

In [26]:
df.head()

,Rank,Name,Age,Gender,Background,Python,Machine Learning,total,city
0,Rank 1,Ravi,23,Male,Tech,89,95,184,chennai
1,Rank 2,Chandni,22,Female,Non-Tech,78,83,161,delhi
2,Rank 3,Gyanesh,25,Male,Tech,70,80,150,mumbai
3,Rank 4,Rahul,22,Male,Tech,68,75,143,chennai
4,Rank 5,Kartik,23,Male,Tech,60,70,130,delhi

In [27]:
df["city"].unique()

array(['chennai', 'delhi', 'mumbai', 'kerala'], dtype=object)

In [28]:
df["Age"].mean()

22.8

In [29]:
df[df["city"]=="chennai"]

,Rank,Name,Age,Gender,Background,Python,Machine Learning,total,city
0,Rank 1,Ravi,23,Male,Tech,89,95,184,chennai
3,Rank 4,Rahul,22,Male,Tech,68,75,143,chennai
6,Rank 7,Maya,22,Female,Non-Tech,55,50,105,chennai

In [30]:
df[df["city"]=="chennai"]['total'].mean()

144.0

In [31]:
df.groupby("city")['total'].mean()

city
chennai    144.000000
delhi      130.333333
kerala      91.000000
mumbai     120.000000
Name: total, dtype: float64

In [32]:
df.groupby("Gender")["Age"].mean()

Gender
Female    23.000000
Male      22.666667
Name: Age, dtype: float64

In [34]:
#df=df((df(df['city']=="chennai")) and (df['Gender']=='Male'))['Age'].mean()

In [53]:
df[df['city']=="chennai"]["python"].mean()

KeyError: 'python'

In [36]:
df.head()

,Rank,Name,Age,Gender,Background,Python,Machine Learning,total,city
0,Rank 1,Ravi,23,Male,Tech,89,95,184,chennai
1,Rank 2,Chandni,22,Female,Non-Tech,78,83,161,delhi
2,Rank 3,Gyanesh,25,Male,Tech,70,80,150,mumbai
3,Rank 4,Rahul,22,Male,Tech,68,75,143,chennai
4,Rank 5,Kartik,23,Male,Tech,60,70,130,delhi

In [49]:
df

,Rank,Name,Age,Gender,Background,Python,Machine Learning,total,city
0,Rank 1,Ravi,23,Male,Tech,89,95,184,chennai
1,Rank 2,Chandni,22,Female,Non-Tech,78,83,161,delhi
2,Rank 3,Gyanesh,25,Male,Tech,70,80,150,mumbai
3,Rank 4,Rahul,22,Male,Tech,68,75,143,chennai
4,Rank 5,Kartik,23,Male,Tech,60,70,130,delhi
5,Rank 6,Pratiksha,24,Female,Non-Tech,58,55,113,mumbai
6,Rank 7,Maya,22,Female,Non-Tech,55,50,105,chennai
7,Rank 8,Shani,21,Male,Tech,50,50,100,delhi
8,Rank 9,Neelam,24,Female,Non-Tech,50,47,97,mumbai
9,Rank 10,Mangal,22,Male,Non-Tech,45,46,91,kerala

In [48]:
df[(df['city']=="chennai") & (df['Gender']=="Male")]["total"].mean()

163.5

In [ ]:
^^^^^the above is the mean of the <total> of the subbset contains city as chennai and gender as male^^^^^